In [1]:
import pandas as pd
import numpy as np

In [ ]:
# Q1). drop the first row from the data set
# Q2). Remove all nan value from the data set
# Q3). Replace '-' with column Mean

In [2]:
cd

C:\Users\HP

In [3]:
cd downloads

C:\Users\HP\downloads

In [4]:
lend=pd.read_excel('Lending Data.xlsx')

In [5]:
lend.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 97 entries, 0 to 96
Data columns (total 14 columns):
Name of Lending Institution    96 non-null object
HQ State                       93 non-null object
Rank                           94 non-null object
TA Ratio1                      94 non-null object
TBL Ratio1                     94 non-null object
Amount ($1,000)                94 non-null object
Number                         94 non-null object
Lender Asset Size              94 non-null object
Amount ($1,000).1              94 non-null float64
Number .1                      94 non-null float64
Unnamed: 10                    0 non-null float64
Amount ($1,000).2              94 non-null float64
Number .2                      94 non-null float64
CC Amount/TA1                  94 non-null object
dtypes: float64(5), object(9)
memory usage: 10.7+ KB

In [7]:
lend.shape

(97, 14)

In [8]:
lend.head()

,Name of Lending Institution,HQ State,Rank,TA Ratio1,TBL Ratio1,"Amount ($1,000)",Number,Lender Asset Size,"Amount ($1,000).1",Number .1,Unnamed: 10,"Amount ($1,000).2",Number .2,CC Amount/TA1
0,NaN,NaN,-1,-2,-3,-4,-5,-6,-7.0,-8.0,NaN,-9.0,-10.0,-11
1,American Express Co.,NY,1,0.23829,0.999544,16350038,3603226,>$50B,16318089.0,3603088.0,NaN,31949.0,138.0,0.28
2,First Citizens Banchares,NC,2,0.187393,0.49083,3914507,117702,$10B-$50B,378394.0,105081.0,NaN,3536113.0,12621.0,.
3,Wintrust Financial Corp.,IL,3,0.168999,0.383561,2842793,136801,$10B-$50B,800526.0,126455.0,NaN,2042267.0,10346.0,0
4,Zions Bancorp,UT,4,0.117973,0.260577,6231770,52612,>$50B,526206.0,32973.0,NaN,5705564.0,19639.0,0

In [9]:
lend.tail()

,Name of Lending Institution,HQ State,Rank,TA Ratio1,TBL Ratio1,"Amount ($1,000)",Number,Lender Asset Size,"Amount ($1,000).1",Number .1,Unnamed: 10,"Amount ($1,000).2",Number .2,CC Amount/TA1
92,Charles Schwab Bk,NV,NR,-,-,-,-,>$10B,0.0,0.0,NaN,0.0,0.0,.
93,Third FS&LA,OH,NR,-,-,-,-,>$10B,0.0,0.0,NaN,0.0,0.0,.
94,"*The bank was formerly known as GE Money Bank,...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
95,1 TA = total domestic assets held by the lende...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
96,"Source: U.S. Small Business Administration, Of...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
lend.columns

Index(['Name of Lending Institution', 'HQ State', 'Rank', 'TA Ratio1',
       'TBL Ratio1', 'Amount ($1,000)', 'Number ', 'Lender Asset Size',
       'Amount ($1,000).1', 'Number .1', 'Unnamed: 10', 'Amount ($1,000).2',
       'Number .2', 'CC Amount/TA1'],
      dtype='object')

In [13]:
del lend['Unnamed: 10']# we are removing this columns because it all contains nan  value and we are data ckenning or asked to remove nan value

In [14]:
lend.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 97 entries, 0 to 96
Data columns (total 13 columns):
Name of Lending Institution    96 non-null object
HQ State                       93 non-null object
Rank                           94 non-null object
TA Ratio1                      94 non-null object
TBL Ratio1                     94 non-null object
Amount ($1,000)                94 non-null object
Number                         94 non-null object
Lender Asset Size              94 non-null object
Amount ($1,000).1              94 non-null float64
Number .1                      94 non-null float64
Amount ($1,000).2              94 non-null float64
Number .2                      94 non-null float64
CC Amount/TA1                  94 non-null object
dtypes: float64(4), object(9)
memory usage: 10.0+ KB

In [18]:
lend=lend.dropna() # remove all rows with nan value.

In [20]:
lend.info() # all rows drooped with nan value

<class 'pandas.core.frame.DataFrame'>
Int64Index: 93 entries, 1 to 93
Data columns (total 13 columns):
Name of Lending Institution    93 non-null object
HQ State                       93 non-null object
Rank                           93 non-null object
TA Ratio1                      93 non-null object
TBL Ratio1                     93 non-null object
Amount ($1,000)                93 non-null object
Number                         93 non-null object
Lender Asset Size              93 non-null object
Amount ($1,000).1              93 non-null float64
Number .1                      93 non-null float64
Amount ($1,000).2              93 non-null float64
Number .2                      93 non-null float64
CC Amount/TA1                  93 non-null object
dtypes: float64(4), object(9)
memory usage: 10.2+ KB

In [21]:
lend.shape

(93, 13)

In [24]:
lend.isnull().sum()

Name of Lending Institution    0
HQ State                       0
Rank                           0
TA Ratio1                      0
TBL Ratio1                     0
Amount ($1,000)                0
Number                         0
Lender Asset Size              0
Amount ($1,000).1              0
Number .1                      0
Amount ($1,000).2              0
Number .2                      0
CC Amount/TA1                  0
dtype: int64

In [25]:
lend.head()

,Name of Lending Institution,HQ State,Rank,TA Ratio1,TBL Ratio1,"Amount ($1,000)",Number,Lender Asset Size,"Amount ($1,000).1",Number .1,"Amount ($1,000).2",Number .2,CC Amount/TA1
1,American Express Co.,NY,1,0.23829,0.999544,16350038,3603226,>$50B,16318089.0,3603088.0,31949.0,138.0,0.28
2,First Citizens Banchares,NC,2,0.187393,0.49083,3914507,117702,$10B-$50B,378394.0,105081.0,3536113.0,12621.0,.
3,Wintrust Financial Corp.,IL,3,0.168999,0.383561,2842793,136801,$10B-$50B,800526.0,126455.0,2042267.0,10346.0,0
4,Zions Bancorp,UT,4,0.117973,0.260577,6231770,52612,>$50B,526206.0,32973.0,5705564.0,19639.0,0
5,Synovus Financial Corp.,GA,5,0.162333,0.381387,4227168,22675,$10B-$50B,539666.0,9593.0,3687502.0,13082.0,0.01

In [26]:
lend.tail()

,Name of Lending Institution,HQ State,Rank,TA Ratio1,TBL Ratio1,"Amount ($1,000)",Number,Lender Asset Size,"Amount ($1,000).1",Number .1,"Amount ($1,000).2",Number .2,CC Amount/TA1
89,USAA Svg. Bank,NV,NR,0,-,0,1,>$10B,0.0,1.0,0.0,0.0,.
90,State Street Corp.,MA,NR,-,-,-,-,>$50B,0.0,0.0,0.0,0.0,0
91,E Trade Bk,VA,NR,-,-,-,-,>$10B,0.0,0.0,0.0,0.0,.
92,Charles Schwab Bk,NV,NR,-,-,-,-,>$10B,0.0,0.0,0.0,0.0,.
93,Third FS&LA,OH,NR,-,-,-,-,>$10B,0.0,0.0,0.0,0.0,.

In [27]:
lend=lend.replace('-',np.nan)

In [28]:
lend.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 93 entries, 1 to 93
Data columns (total 13 columns):
Name of Lending Institution    93 non-null object
HQ State                       93 non-null object
Rank                           93 non-null object
TA Ratio1                      89 non-null float64
TBL Ratio1                     88 non-null float64
Amount ($1,000)                89 non-null float64
Number                         89 non-null float64
Lender Asset Size              93 non-null object
Amount ($1,000).1              93 non-null float64
Number .1                      93 non-null float64
Amount ($1,000).2              93 non-null float64
Number .2                      93 non-null float64
CC Amount/TA1                  93 non-null object
dtypes: float64(8), object(5)
memory usage: 10.2+ KB

In [29]:
lend=lend.fillna(lend.mean())

In [32]:
lend.tail()

,Name of Lending Institution,HQ State,Rank,TA Ratio1,TBL Ratio1,"Amount ($1,000)",Number,Lender Asset Size,"Amount ($1,000).1",Number .1,"Amount ($1,000).2",Number .2,CC Amount/TA1
89,USAA Svg. Bank,NV,NR,0.000000,0.251196,0.000000e+00,1.000000,>$10B,0.0,1.0,0.0,0.0,.
90,State Street Corp.,MA,NR,0.048668,0.251196,3.184791e+06,216418.955056,>$50B,0.0,0.0,0.0,0.0,0
91,E Trade Bk,VA,NR,0.048668,0.251196,3.184791e+06,216418.955056,>$10B,0.0,0.0,0.0,0.0,.
92,Charles Schwab Bk,NV,NR,0.048668,0.251196,3.184791e+06,216418.955056,>$10B,0.0,0.0,0.0,0.0,.
93,Third FS&LA,OH,NR,0.048668,0.251196,3.184791e+06,216418.955056,>$10B,0.0,0.0,0.0,0.0,.